jmper-ha/jradio/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
# Pool reserved for allocations that must be internal (DMA descriptors, task
# stacks). The hardware AES driver takes MALLOC_CAP_DMA memory for every TLS
# record, and PSRAM never carries that flag; with the I2S DMA buffers holding
# ~16 KB during playback, this pool is what HTTPS streaming competes for.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
# Plain malloc() below this size prefers internal RAM. The ESP-IDF default of
# 16384 sends almost every allocation in this firmware there, crowding out the
# DMA-capable memory the AES driver needs; 1024 keeps only small, latency
# sensitive allocations internal and pushes the rest to PSRAM.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LWIP_TCP_WND_DEFAULT=16384
CONFIG_LWIP_TCP_RECVMBOX_SIZE=16
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
# CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC is not set
CONFIG_HTTPD_WS_SUPPORT=y
# Must cover the httpd session pool (WEB_SOCKET_SERVER_SOCKET_CAPACITY, see
# web_socket.h) plus the internet radio's streaming HTTP client socket and a
# few spares for DNS/mDNS lookups.
CONFIG_LWIP_MAX_SOCKETS=16
